docs/blog/things-id-like-to-see.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-27 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Things I'd like to see</title>
<meta name="description" content="My bucket list, in a blog post." />
<meta name="keywords" content="personal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/site.css"/><link rel="icon" type="image/x-icon" href="/static/favicon.ico"/></head>
<body>
<header id="top" class="status">
<div class="nav">
  <ul id="navlinks" class="horizontal-list">
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/blog/index.html">Blog</a>
    </li>
    <li>
      <a href="/about.html">About</a>
    </li>
  </ul>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Things I&rsquo;d like to see</h1>
</header><p>
This is a non-exhaustive list of the things I&rsquo;d like to see in my
lifetime, in no particular order.
</p>

<section id="outline-container-orgf0c29c2" class="outline-2">
<h2 id="orgf0c29c2">Clean rivers</h2>
<div class="outline-text-2" id="text-orgf0c29c2">
<p>
By which I mean unpolluted waters, not potable nor crystal-clear
waters (most rivers have way too much sediment for those). Depending
on where you live, you might (already, or still) be able to swim and
fish on a close-by river; I simply would like to see a future where
virtually all rivers are like this.
</p>

<p>
Of course I also wish for a generally clean environment: clean air,
clean oceans, etc. We don&rsquo;t have to sacrifice material comfort for
this &#x2014; technology enabling this reality exists or will come into
existence as long we make it a priority (i.e., invest in it).
</p>
</div>
</section>

<section id="outline-container-org0cf29fc" class="outline-2">
<h2 id="org0cf29fc">Betelgeuse going supernova</h2>
<div class="outline-text-2" id="text-org0cf29fc">
<p>
<a href="https://en.wikipedia.org/wiki/Betelgeuse">Betelgeuse</a> is one of the brightest stars in the night sky, and is due
to go supernova (explode) shortly &#x2014; sometime in the next 100000
years or so. While it&rsquo;s extremely unlikely it will happen before you
or I die, it would be super cool to see, since it would be visible
even during daytime, and at night it should be very bright (less
bright than the moon but comparably so).
</p>
</div>
</section>

<section id="outline-container-org89ef133" class="outline-2">
<h2 id="org89ef133">The end of the ‘economic problem’</h2>
<div class="outline-text-2" id="text-org89ef133">
<p>
The term ‘economic problem’ is used by Keynes in his <a href="http://www.econ.yale.edu/smith/econ116a/keynes1.pdf">essay</a> ‘The
economic possibilities of our children’, which I heartly
recommend. The essay does show its age at times, but the idea is that
rapid increases in productivity (enabled by technology) would allow
humans to work much less for higher standards of living than ever
before.
</p>

<p>
An important matter is whether this will turn most of us into
lethargic people dependent on government handouts (as in <i>The Expanse</i>
science fiction <a href="https://en.wikipedia.org/wiki/The_Expanse_(novel_series)">series</a>) or into freer beings who can than enjoy life
more fully (which for some people still includes working a lot) as in
the <i>Terra Ignota</i> <a href="https://en.wikipedia.org/wiki/Terra_Ignota">series</a>. Because I think it&rsquo;s unlikely to happen,
I&rsquo;m excluding the outcome commonly shown in cyberpunk-esque science
fiction, which is that this increase in productivity gets almost
completely captured by an elite and the rest of humanity actually
lives much worse than we do now (but with shinier dystopic-<i>er</i>
technology than the one we have today).
</p>
</div>
</section>

<section id="outline-container-org78c7e26" class="outline-2">
<h2 id="org78c7e26">Finding extra-terrestrial life</h2>
<div class="outline-text-2" id="text-org78c7e26">
<p>
No, not aliens. I mean, <i>technically</i> aliens, but I&rsquo;m thinking more
towards finding conclusive evidence of past microbial life on Mars (as
<a href="https://en.wikipedia.org/wiki/Perseverance_(rover)">Percy</a> is trying to do on Mars), or somewhere else in the solar system
(e.g., on <a href="https://en.wikipedia.org/wiki/Europa_(moon)">Europa</a>). It&rsquo;s likely we won&rsquo;t be able to ascertain anything
about life farther than that anytime soon, so I&rsquo;m hoping for us to
find other life here in the neighbourhood.
</p>

<p>
Or else it&rsquo;s just too lonely out there… I mean, not really, but it
would very interesting to see a whole other biology, wouldn&rsquo;t it?
</p>
</div>
</section>
</main>
</body>
</html>
